backend/modules/nmd/views/chart/index.php

SELECT `ct`.`type` AS `customer_type`, `tt`.`type` AS `transaction_type`, COUNT(*) AS `transaction_count`, SUM(t.amount) AS `total_amount`, `ts`.`status` AS `transaction_status`, `t`.`transaction_date`, `pm`.`method` AS `payment_method` FROM `transaction` `t` INNER JOIN `customer` `c` ON t.customer_id = c.id INNER JOIN `customer_type` `ct` ON c.customer_type = ct.id INNER JOIN `transaction_type` `tt` ON t.transaction_type = tt.id INNER JOIN `transaction_status` `ts` ON t.transaction_status = ts.id INNER JOIN `payment_method` `pm` ON t.payment_method = pm.id WHERE `t`.`division`='1' GROUP BY `ct`.`type`, `tt`.`type`, `ts`.`status`, `t`.`transaction_date`, `pm`.`method` ORDER BY `transaction_count` DESC
---
}

//transaction used per customer type
$customerTypeDatapertransaction = (new \yii\db\Query())
    ->select([
        'ct.type as customer_type',
        'tt.type as transaction_type',
        'COUNT(*) as transaction_count',
        'SUM(t.amount) as total_amount',
        'ts.status as transaction_status',
        't.transaction_date',
        'pm.method as payment_method',
    ])
    ->from('transaction t')
    ->where(['t.division' => '1',])
    ->join('INNER JOIN', 'customer c', 't.customer_id = c.id')
    ->join('INNER JOIN', 'customer_type ct', 'c.customer_type = ct.id')
    ->join('INNER JOIN', 'transaction_type tt', 't.transaction_type = tt.id')
    ->join('INNER JOIN', 'transaction_status ts', 't.transaction_status = ts.id')
    ->join('INNER JOIN', 'payment_method pm', 't.payment_method = pm.id')
    ->groupBy(['ct.type', 'tt.type', 'ts.status', 't.transaction_date', 'pm.method'])
    ->orderBy(['transaction_count' => SORT_DESC])
    ->all();

SELECT SUM(amount) FROM `transaction` WHERE (`division`='1') AND (`transaction_date`='2023-12-03')
---
    ])
    ->scalar();

$lastmettrans = (new Query())
    ->select('COUNT(*)')
    ->from('transaction')
    ->where([
        'division' => '1',
        'transaction_date' => date('Y-m-d', strtotime('-1 day'))
    ])
    ->scalar();

SELECT `transaction_date`, COUNT(*) AS `transaction_count` FROM `transaction` WHERE `division`='1' GROUP BY `transaction_date`
---
    ])
    ->scalar();

$SalesYesterday = (new Query())
    ->select(['SUM(amount)'])
    ->from('transaction')
    ->where([
        'division' => '1',
        'transaction_date' => date('Y-m-d', strtotime('-1 day'))
    ])
    ->scalar();