common/models/User.php

       public static function findByUsernameOrEmail($usernameOrEmail)
    {
        return static::find()
            ->where(['or', ['username' => $usernameOrEmail], ['email' => $usernameOrEmail]])
            ->one();
---
SELECT * FROM `user` WHERE (`username`='super_admin') OR (`email`='super_admin')