backend/views/site/index.php



//S&T transaction
$todaySandTtrans = (new Query())
    ->select('COUNT(*)')
    ->from('transaction')
    ->where([
        'division' => '2',
        'transaction_date' => date('Y-m-d')
    ])
    ->scalar();

$lastSandTtrans = (new Query())
    ->select('COUNT(*)')
    ->from('transaction')
    ->where([
        'division' => '2',
        'transaction_date' => date('Y-m-d', strtotime('-1 day'))
    ])
    ->scalar();
---
SELECT COUNT(*) FROM `transaction` WHERE (`division`='1') AND (`transaction_date`='2023-12-02')
SELECT COUNT(*) FROM `transaction` WHERE (`division`='1') AND (`transaction_date`='2023-12-06')