backend/modules/std/views/chart/index.php

date_default_timezone_set('Asia/Manila');

//Total Transaction everyday changes depending on date
$todaymettrans = (new Query())
    ->select('COUNT(*)')
    ->from('transaction')
    ->where([
        'division' => '2',
        'transaction_date' => date('Y-m-d') // Assuming you want the number of transactions for today
    ])
    ->scalar();
---
SELECT SUM(amount) FROM `transaction` WHERE (`division`='2') AND (`transaction_date`='2023-12-02')



//Here should be the sum of total sales everyday
$SalesToday = (new Query())
    ->select(['SUM(amount)'])
    ->from('transaction')
    ->where([
        'division' => '2',
        'transaction_date' => date('Y-m-d') // Using the current date in 'Y-m-d' format
    ])
    ->scalar();
---
SELECT `transaction_date`, COUNT(*) AS `transaction_count` FROM `transaction` WHERE `division`='2' GROUP BY `transaction_date`